var globalErrorMsg = {
	getErrMsg : function(errorNum, replaceSet) {
		var srcStr = this[errorNum];
		if (typeof replaceSet === 'number' || typeof replaceSet === 'string') {
			return srcStr.replace(/#:(.*?)#/g, replaceSet);
		}
		if (typeof replaceSet === 'object') {
			for ( var obj in replaceSet) {
				srcStr = srcStr.replace(new RegExp('#:' + obj + '#', 'g'), replaceSet[obj]);
			}
		}
		return srcStr;
	},
	'100000' : '请选择一行记录进行修改！', // warn提示框
	'100001' : '请选择一行记录进行删除！', // warn提示框
	'100002' : '保存成功！', // success提示框
	'100003' : '新增成功！', // success提示框
	'100004' : '修改成功！', // success提示框
	'100005' : '删除成功！', // success提示框
	'100006' : '审核成功！', // success提示框
	'100012' : '保存失败！', // error提示框
	'100013' : '新增失败！', // error提示框
	'100014' : '修改失败！', // error提示框
	'100015' : '此记录已被引用，不允许删除！', // error提示框
	'100016' : '确认删除所选记录？', // confirm提示框
	'100017' : '删除失败,该记录已经被引用！', // error提示框
	'100018' : '审核失败！', // error提示框
	'100019' : '审批成功！', // success提示框
	'100020' : '审批失败！', // error提示框
	'100091' : '您没有该操作权限！', // error提示框
	'100092' : '登录超时，请重新登录！', // confirm提示框
	'100093' : '操作失败！', // error提示框
	'100094' : '输入内容不能包含">"或"<"！', // error提示框
	'100095' : '请选择操作节点！', // error提示框
	'100021' : '文件上传成功！', // error提示框
	'100022' : '请选择上传文件！', // error提示框
	'100023' : '导出条件不足，无法导出Excel！',// error提示框
	'100024' : '是否覆盖当前图片？', // confirm提示框
	'100025' : '上传的文件太大，文件大小不能超过5M！', // error提示框
	'100026' : '不允许上传exe、bat、cmd格式文件！', // error提示框
	'100027' : '是否覆盖当前附件？', // confirm提示框
	'100028' : '请选择一行记录进行复制！', // warn提示框
	'100029' : '请选择一行进行粘贴！', // warn提示框
	'100030' : '请选择一行进行清空！', // warn提示框
	'100031' : '请选择一条记录！', // warn提示框

	'100100' : '用户名密码错误！', // error提示框
	'100101' : '该用户未分配角色！', // error提示框
	'100102' : '新密码两次输入不一致！<br>请重新输入。', // error提示框
	'100103' : '旧密码输入错误！<br>请重新输入。', // error提示框
	'100106' : '修改成功，请登录系统！', // success提示
	'100109' : '初始化密码', // 无提示，弹窗修改
	'100110' : '登录用户名不能为空！', // error提示框
	'100111' : '新密码不能为空！', // error提示框
	'100112' : '新密码确认不能为空！', // error提示框
	'100113' : '旧密码不能为空！', // error提示框

	// 部门管理
	'100200' : '部门名称不能为空！',// error提示框
	'100201' : '部门名称不能重复！',// error提示框
	// 角色管理
	'100300' : '角色名称不能为空！',// error提示框
	'100301' : '角色名称不能重复！',// error提示框
	
	// 用户管理
	'100111' : '性别不能为空！',// error提示框
//	'100100' : '生日不能为空！',// error提示框
	'100400' : '用户账户不能为空！',// error提示框
	'100401' : '用户账户不能重复！',// error提示框
	'100402' : '姓名不能为空！',// error提示框
	'100403' : '部门不能为空！',// error提示框
	'100404' : '性别不能为空！',// error提示框
	'100405' : '职务不能为空！',// error提示框
	'100406' : '手机号不能为空！',// error提示框
	'100407' : '公司分机号不能为空！',// error提示框
	'100408' : 'QQ号不能为空！',// error提示框
	'100409' : '真实姓名不能为空',// error提示框
	'100410' : '生日不能为空',// error提示框
	'100411' : '学号不能为空',// error提示框
	'100412' : '学生姓名不能为空',// error提示框
	'100413' : '学生性别不能为空',// error提示框
	'100414' : '学生年龄不能为空',// error提示框
	'100415' : '课程号不能为空',// error提示框
	'100416' : '课程名不能为空',// error提示框
	'100417' : '成绩不能为空',// error提示框
	'100418' : '此记录在成绩表中已有成绩，不允许删除！',// error提示框
	'100419' : '该课程已经有成绩，不能删除',// error提示框
	
	// 员工管理
	'100901' : '员工ID不能为空！',// error提示框
	'100902' : '姓名不能为空！',// error提示框
	'100903' : '性别不能为空！',// error提示框
	'100904' : '职务ID不能为空！',// error提示框
	'100905' : '职务不能为空！',// error提示框
	'100906' : '职务等级不能为空！',// error提示框
	'100907' : '部门ID不能为空！',// error提示框
	'100908' : '部门不能为空！',// error提示框
	'100909' : '部门等级不能为空',// error提示框
	'100910' : '手机号不能为空',// error提示框
	'100911' : '分机号不能为空',// error提示框
	'100912' : '邮箱不能为空',// error提示框
	'100913' : '办公地点不能为空',// error提示框
	'100914' : '员工状态不能为空',// error提示框
	'100915' : '手机号2不能为空',// error提示框
	'100916' : 'QQ号不能为空',// error提示框
//	'100917' : '成绩不能为空',// error提示框
//	'100918' : '该学生已经有成绩，不能删除',// error提示框
//	'100919' : '该课程已经有成绩，不能删除',// error提示框
	
	//客户管理
	'200200' : '此信息状态已提交不能进行修改！',//error提示框
	'200201' : '请填写完整客户信息后进行提交！',//error提示框
	'200202' : '身份证号重复！',//error提示框
	
	// 贷款管理
	'300101' : '请填写完整初审意见后进行提交！',// error提示框
	'300104' : '请把审核意见填写完整后进行提交！',// error提示框
	'300105' : '该学生已经有得分纪录，是否删除！',//error提示框
	
	// 车辆管理
	'400101' : '该车辆已经分配，请先收回！',// error提示框
	'400102' : '该车辆未被分配，不能收回！',// error提示框
	'400103' : '确认收回车辆吗？',// error提示框
	'400104' : '车辆回收成功！', // success提示框
	// cdemo
	'S99901' : '名称不能为空！',
	'S99902' : '数字属性不能为空！',
	'S99903' : '字符属性不能为空！',
	'S99904' : '日期属性不能为空！'
};
